Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: མུན་པ་ཡང་མ་ཡིན་པ་ཡང་མི་གཟིགས་པས་དེའི་ཕྱིར་སྤྱོད་ཡུལ་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་རྣམ་པར་དག་པ་ལ་རྣམ་པར་བརྟག་ཏུ་ཡང་མི་རུང་ལ་འདིར་སྤྱོད་པ་ཞེས་བྱ་བ་མེད་ཀྱང་འགོག་པ་དང་ལམ་གྱི་གཞི་བྱེད་པའི་ཕྱིར་ཆོས་ཀྱི་སྐུ་འདི་ལ་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་རྣམ་པ་སྣ་ཚོགས་སྣང་བར་འགྱུར་བར་རིག་པར་བྱའོ། །རིགས་ཀྱི་བུ་སྐུ་འདིའི་རྒྱུ་དང་།
en: Therefore, the pure field of experience and pure wisdom cannot be examined, and though there is nothing to call ‘conduct’ in this, it is the basis for cessation and the path. Therefore, one should know that the various deeds of a tathāgata appear within this Dharma body. “

source: རྐྱེན་དང་། སྤྱོད་ཡུལ་དང་། གནས་དང་། འབྲས་བུ་དང་། རྩ་བ་དཔག་པར་དཀའ་བའི་ཕྱིར་གང་གིས་ཁོང་དུ་ཆུད་པར་གྱུར་ན་སྐུ་དེ་ཉིད་ཐེག་པ་ཆེན་པོའོ།
en: Noble one, it is difficult to evaluate this body’s cause, condition, field of experience, location, result, and basis, and therefore it is comprehended that this body itself is the Mahāyāna.

source: །དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་ནོ།
en: It is the nature of the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོའོ།
en: It is the essence of the tathāgatas.

source: །སྐུ་འདི་ཉིད་ལ་བརྟེན་ནས་དང་པོ་བསྐྱེད་པའི་སེམས་ཀྱང་ཐོབ་པར་འགྱུར་རོ།
en: On the basis of this body, the first development of the aspiration for enlightenment is attained.

source: །རྣལ་འབྱོར་སྒོམ་པའི་ས་པའི་སེམས་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: There is also the appearance of the mind that practices meditation on the bhūmis.

source: །ཕྱིར་མི་ལྡོག་པའི་སེམས་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ། །ཚེ་གཅིག་གིས་ཐོགས་པའི་སེམས་དང་། རྡོ་རྗེའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པའི་སེམས་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: There is the appearance of the irreversible mind, the mind with one life remaining, and there appears the vajra mind and even the mind of a tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་གྱ་ནོམ་པ་ཚད་མེད་ཅིང་མཐའ་མེད་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: In the same way, there appear all the measureless, endless sublime qualities of the tathāgatas.

source: །ཆོས་ཀྱི་སྐུ་འདི་ལ་བརྟེན་ནས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་རྣམས་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: On the basis of the Dharma body there also appear countless great samādhis.

source: །ཆོས་ཀྱི་སྐུ་འདི་ལ་བརྟེན་ནས་ཡེ་ཤེས་ཆེན་པོ་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་འགྱུར་བས་དེའི་ཕྱིར་སྐུ་གཉིས་པོ་འདི་དག་ནི་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ལ་བརྟེན་ནས་མངོན་དུ་སྣང་བར་འགྱུར་རོ།
en: Also, all great wisdom arises on the basis of this Dharma body. Therefore, the two bodies appear on the basis of samādhi and wisdom. “

source: །ཆོས་ཀྱི་སྐུ་འདི་ལྟ་བུ་འདི་ནི་རང་གི་ངོ་བོ་ཉིད་ལ་གནས་པས་རྟག་པ་ཞེས་ཀྱང་བསྟན་ཏོ།
en: This Dharma body depends upon its own nature, and so it is called ‘eternal.’

source: །ང་ཞེས་ཀྱང་བསྟན་ཏོ།
en: It is also called ‘self.’

source: །ཏིང་ངེ་འཛིན་ཆེན་པོ་ལ་གནས་པའི་ཕྱིར་སྐྱིད་པ་ཞེས་ཀྱང་བསྟན་ཏོ།
en: As it depends upon great samādhi, it is called ‘bliss.’

source: །ཡེ་ཤེས་ཆེན་པོ་ལ་གནས་པའི་ཕྱིར་ཡོངས་སུ་གཙང་བ་ཞེས་ཀྱང་བསྟན་ཏེ།
en: As it depends upon great wisdom, it is called ‘purity.’

source: དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པར་བཞུགས་པ་དང་། མངའ་དབང་བརྙེས་པ་དང་བདེ་ཞིང་སྐྱིད་པ་དང་། ཡོངས་སུ་གཙང་བར་གྱུར་པ་ཡིན་ནོ།
en: Therefore, a tathāgata remains permanently, has attained power, is blissful and happy, and has become completely pure. “

source: །ཏིང་ངེ་འཛིན་ཆེན་པོ་ལ་བརྟེན་ནས་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་སོགས་པ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ཆོས་དྲན་པ་ཆེན་པོ་ལ་སོགས་པ་དྲན་པ་ཉེ་བར་གཞག་པ་ཐམས་ཅད་དང་། བྱམས་པ་ཆེན་པོ་དང་། ཐུགས་རྗེ་ཆེན་པོ་དང་། གཟུངས་ཐམས་ཅད་དང་།
en: On the basis of great samādhi, there manifest all samādhis, such as the heroic samādhi; all mindfulness, such as the great mindfulness of phenomena; all the qualities of the buddhas, such as great love and great compassion; and all retentions, all higher cognitions, all powers, and the possession of all the qualities of equality. “

source: མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་། དབང་ཐམས་ཅད་དང་། ཆོས་མཉམ་པ་ཐམས་ཅད་ཡང་དག་པར་སྡུད་ཅིང་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་མངོན་དུ་འབྱུང་བར་འགྱུར་རོ། །ཡེ་ཤེས་ཆེན་པོ་འདི་ལ་བརྟེན་ནས་སྟོབས་བཅུ་དང་། བསྙེངས་པ་མི་མངའ་བ་བཞི་དང་།
en: On the basis of this great wisdom, there appear the ten strengths, the four confidences, the four discernments, the hundred and eighty unique qualities, and so on—countless wonderful, marvelous qualities. “

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། མ་འདྲེས་པའི་ཆོས་བརྒྱ་བརྒྱད་ཅུ་དང་། ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ་དཔེར་ན་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ལ་བརྟེན་ནས་རིན་པོ་ཆེ་ཚད་མེད་ཅིང་མཐའ་མེད་པ་རྣམ་པ་སྣ་ཚོགས་སྣང་བར་འགྱུར་བ་དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་ཆེན་པོའི་རིན་པོ་ཆེ་དང་།
en: As an analogy, on the basis of a precious wish-fulfilling jewel, there appear the various kinds of countless, innumerable jewels.

source: ཤེས་རབ་ཆེན་པོའི་རིན་པོ་ཆེ་ལ་བརྟེན་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་གྱ་ནོམ་པ་ཚད་མེད་ཅིང་མཐའ་མེད་པ་རྣམ་པ་སྣ་ཚོགས་མངོན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: In the same way, on the basis of precious samādhi and precious wisdom, there arise the various countless, innumerable sublime qualities of the buddhas. “

source: །རིགས་ཀྱི་བུ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་སྐུའི་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་མཚན་མ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་ཤིང་མཚན་མ་ལ་མངོན་པར་ཞེན་པར་མི་འགྱུར་བས་རྣམ་པར་བརྟག་ཏུ་མི་རུང་ལ།
en: Noble one, that Dharma body, samādhi, and wisdom transcend all characteristics, and there is no attachment to characteristics, so that they cannot be analyzed.

source: རྟག་པ་ཡང་མ་ཡིན་ཆད་པ་ཡང་མ་ཡིན་པས་དབུ་མའི་ལམ་ཞེས་བྱའོ།
en: They are neither permanent nor nothingness, and that is why they are called ‘the path of the middle way.’ “

source: །རྣམ་པར་རྟོག་པ་མངའ་ཡང་ངོ་བོ་ཉིད་ལ་རྣམ་པར་རྟོག་པ་མི་མངའོ།
en: Even though there are thoughts, in the essential nature there are no thoughts.

source: །གསུམ་དུ་བགྲང་བ་ཡོད་ཀྱང་ངོ་བོ་ཉིད་ལ་གསུམ་དུ་འགྱུར་བ་མེད་པས་འཕེལ་བ་ཡང་མེད། འགྲིབ་པ་ཡང་མེད།
en: Even though there is a threefold enumeration, in essence there are no three and therefore no increase or decrease.

source: རྨི་ལམ་དང་སྒྱུ་མ་ལྟ་བུར་གཟུང་བ་ཡང་མེད།
en: It is like an illusion or a dream, where there is no object and no subject.

source: འཛིན་པ་ཡང་མེད་པས་ཆོས་ཀྱི་སྐུའི་དེ་བཞིན་ཉིད་རྣམ་པར་གྲོལ་བའི་གནས་འཆི་བདག་གི་རྒྱལ་པོའི་ཡུལ་ལས་ཡང་དག་པར་འདས་པ་སྐྱེ་ཤིའི་མུན་པ་ལས་མངོན་པར་འཕགས་པ།
en: Therefore, the essential nature of the Dharma body is the state of liberation, which is beyond the scope of Yama’s realm. It has risen above the darkness of saṃsāra.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསྒྲུབ་པར་མི་ནུས་ཤིང་བགྲོད་པར་མི་ནུས་པ།
en: Beings are unable to accomplish it, unable to reach it.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཞུགས་པའི་གནས་སུ་གྱུར་པའོ།
en: It is the state in which the buddhas and bodhisattvas dwell. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་མི་ཞིག་གསེར་འདོད་པས་དེ་དང་དེ་དག་ཏུ་གསེར་གྱི་རྡོ་ཡོངས་སུ་བཙལ་བ་ལས་གསེར་གྱི་རྡོ་དེ་རྙེད་ནས་ཞིབ་མོར་བཏགས་ཏེ་སྙིང་པོ་གང་ཡིན་པ་བླངས་ནས་སོ་མལ་དུ་བཞུས་བཏུལ་ནས་གསེར་ཡོངས་སུ་དག་པ་རྙེད་པར་གྱུར་ན་ཡིད་བཞིན་དུ་བསྒྱུར་ཏེ།
en: As an analogy, noble one, if there were a man who wanted gold, he would search everywhere for gold ore, and when he found gold ore, he would grind it to powder, extract its essence, smelt it, and obtain pure gold as he wished for.

source: གདུ་བུ་ལ་སོགས་པ་རྒྱན་གྱི་རྣམ་པ་སྣ་ཚོགས་སུ་བྱས་ནས་སྤྱོད་པ་མང་པོ་དང་ལྡན་པར་གྱུར་ཀྱང་གསེར་གྱི་རང་བཞིན་ལ་ནི་འགྱུར་བ་ཅི་ཡང་མེད་དོ།
en: Then he would make it into various kinds of jewelry such as rings, and though he used it in various ways, the nature of the gold would never change at all. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་རྣམ་པར་གྲོལ་བའི་མཆོག་ཡོངས་སུ་གཉེར་བའམ། འཇིག་རྟེན་པའི་དགེ་བ་མངོན་པར་བསྒྲུབས་པས་དེ་བཞིན་གཤེགས་པའམ་དེའི་སློབ་མའི་འཁོར་མཐོང་ན་ཉེ་བར་བསྙེན་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་དགེ་བ་ནི་གང་ལགས། མི་དགེ་བ་ནི་གང་ལགས།
en: Moreover, noble one, if any noble men or noble women who wanted to attain the supreme liberation or to accomplish good worldly actions were to see the Tathāgata or the followers of the Tathāgata, they would approach and say, ‘Bhagavat, what is a good action and what is a bad action?

source: ཡང་དག་པའི་རྣལ་འབྱོར་བསྒོམས་པས་རྣམ་པར་དག་པའི་སྤྱོད་པ་འཐོབ་པར་འགྱུར་བ་ནི་གང་ལགས། ཞེས་གསོལ་པ་དང་།
en: What is true practice through which one attains pure conduct?’

source: དེ་བཞིན་གཤེགས་པ་དང་སློབ་མའི་འཁོར་རྣམས་དེས་དེ་སྐད་དུ་ཞུ་བ་གསོལ་བ་གཟིགས་པར་གྱུར་ན་དེའི་ཚེ་འདི་སྙམ་དུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་འདི་ནི་རྣམ་པར་དག་པ་ཡོངས་སུ་གཉེར་བའི་ཕྱིར་ཡང་དག་པའི་ཆོས་ཡོངས་སུ་མཉན་པར་འདོད་པ་ཡིན་ནོ།
en: Then the Buddha Bhagavat or his followers, on seeing them ask those questions, would at that time think, ‘These noble men and noble women long to hear the Dharma because they are seeking for purity.’

source: །སྙམ་དུ་དགོངས་ནས་དེ་ལ་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པ་ཉིད་ཀྱིས་གོ་བར་མཛད་པར་འགྱུར་བས་དེས་ཐོས་ནས་ཀྱང་ཡང་དག་པའི་དྲན་པས་མི་བརྗེད་པར་བཟུང་སྟེ།
en: Thinking that, they would reveal the Dharma and teach it, so that those noble men and noble women would understand it. “

source: རྣལ་འབྱོར་བསྒོམ་པར་སེམས་བསྐྱེད་པས་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཐོབ་ནས་ལེ་ལོའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ཏེ་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པས་བསླབ་པའི་གནས་རྣམས་ལ་མ་གུས་པ་སྤངས་ནས་རྒོད་པ་དང་འགྱོད་པའི་སེམས་ཉེ་བར་ཞི་བར་བྱས་ཏེ་ས་དང་པོ་ལ་འཇུག་པར་འགྱུར་བས་ས་དང་པོའི་སེམས་ལ་བརྟེན་ནས་སེམས་ཅན་ལ་ཕན་འདོགས་པའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་གཉིས་པར་འཇུག་པ་འཐོབ་པར་འགྱུར་རོ།
en: Then when they heard the Dharma, they would remember it correctly, not forget it, develop the aspiration to practice it, gain the power of diligence, and eliminate the obscuration of idleness and purify themselves of all obscurations, avoid a lack of veneration for the fields of training, pacify agitation and regret in the mind, and would then enter the first bhūmi. “On the basis of the mind of the first bhūmi, they would eliminate that which obscures benefiting beings so that they enter the second bhūmi.

source: །ས་དེར་ཡང་རྣམ་པར་མི་འཚེ་བའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་གསུམ་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate that which obscures nonviolence and enter the third bhūmi.

source: །ས་དེར་ཡང་སེམས་མཉེན་ཞིང་རྣམ་པར་བྱང་བའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་བཞི་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to purifying the mind and making it pliable and enter the fourth bhūmi.

source: །ས་དེར་ཡང་ཐབས་མཁས་པའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་ལྔ་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to skillful methods and enter the fifth bhūmi.

source: །ས་དེར་ཡང་དོན་དམ་པ་དང་། ཀུན་རྫོབ་ཏུ་མཐོང་བའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་དྲུག་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to perceiving ultimate and relative truth and enter the sixth bhūmi.

source: །ས་དེར་ཡང་མཚན་མ་ལ་མཐོང་བར་སྤྱོད་པའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་བདུན་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to the conduct that perceives characteristics and enter the seventh bhūmi.

source: །ས་དེར་ཡང་མཚན་མ་ཉེ་བར་ཞི་བར་མི་མཐོང་བའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་བརྒྱད་པར་འདུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration of not seeing the cessation of characteristics and enter the eighth bhūmi.

source: །ས་དེར་ཡང་སྐྱེ་བའི་མཚན་མར་མི་མཐོང་བའི་སྒྲིབ་པ་ཡོངས་སུ་བསལ་ནས་ས་དགུ་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration of not seeing the arising of characteristics and enter the ninth bhūmi.

source: །ས་དེར་ཡང་མངོན་པར་ཤེས་པ་དྲུག་གི་སྒྲིབ་པ་ཡང་ཡོངས་སུ་བསལ་ནས་ས་བཅུ་པར་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to the six higher cognitions and enter the tenth bhūmi.

source: །ས་དེར་ཡང་ཤེས་བྱའི་སྒྲིབ་པ་དང་རྩ་བའི་སེམས་ཡོངས་སུ་བསལ་ནས་དེ་བཞིན་གཤེགས་པའི་ས་ལ་འཇུག་པར་འགྱུར་རོ།
en: On that bhūmi, they would eliminate the obscuration to knowledge and eliminate the basis consciousness and enter the bhūmi of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པའི་ས་ལ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ཡོངས་སུ་དག་པར་གྱུར་པའི་ཕྱིར་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ།
en: Entry into the bhūmi of the tathāgatas has three purities; therefore, it is called the Perfectly Pure.

source: གསུམ་གང་ཞེ་ན།
en: What are those three?

source: ཉོན་མོངས་པ་རྣམ་པར་དག་པ་དང་། སྡུག་བསྔལ་རྣམ་པར་དག་པ་དང་། མཚན་མ་རྣམ་པར་དག་པ་གང་ཡིན་པའོ།
en: Being pure of the kleśas, being pure of suffering, and being pure of characteristics.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་གསེར་ཡང་དག་པར་བཞུས་སྦྱངས་བརྡུངས་ཏེ་དྲི་མ་མེད་པར་བྱ་བ་ཡང་གསེར་གྱི་རང་བཞིན་གཟོད་མ་ཉིད་ནས་རྣམ་པར་དག་པ་གསལ་བར་བྱེད་པ་ཡིན་པའི་ཕྱིར་གསེར་གྱི་ངོ་བོ་ཉིད་ཡོངས་སུ་དག་པའི་དབང་གིས་གསེར་མེད་པར་འགྱུར་རོ། །ཞེས་བྱར་མི་རུང་ངོ་།
en: This is like when gold has been properly smelted, purified, and beaten, it has been made stainless, but this is making clear its primordial purity. It would not be correct to say that because of the pure nature of gold there was no gold. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ཆུ་རྙོག་མ་ཅན་ཡོངས་སུ་དངས་ཏེ་དྲི་མ་མེད་པར་བྱ་བ་ཡང་ཆུའི་རང་བཞིན་གཟོད་མ་ཉིད་ནས་ཡོངས་སུ་དག་པར་གསལ་བར་བྱེད་པ་ཡིན་པའི་ཕྱིར་ཆུ་མེད་པར་འགྱུར་རོ་ཞེས་བྱར་མི་རུང་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་སྐུ་ཡང་ཉོན་མོངས་པ་དང་འདྲེས་པར་གྱུར་པས་སྡུག་བསྔལ་བ་དང་ཀུན་འབྱུང་བ་ཡོངས་སུ་བསལ་ནས་བག་ཆགས་ལྷག་མ་མེད་པར་བྱ་བ་ཡང་སངས་རྒྱས་ཀྱི་རང་བཞིན་གཟོད་མ་ཉིད་ནས་རྣམ་པར་དག་པ་གསལ་བར་བྱེད་པ་ཡིན་པའི་ཕྱིར་ངོ་བོ་ཉིད་མེད་པར་འགྱུར་རོ་ཞེས་བྱར་མི་རུང་ངོ་།
en: As an analogy, muddied water becomes clear, and though it becomes stainless it is the primordially pure nature of water that is made evident; therefore, it would not be correct to say that there was no water. In that same way, because the Dharma body is mixed with the kleśas, when suffering and its origination are completely eliminated and there is no remainder of negative tendencies, the primordially pure nature of buddhahood is made clear. Therefore, it would not be correct to say that this essence was nonexistent. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་དུ་བ་དང་། སྤྲིན་དང་། རྡུལ་དང་། ཁུག་རྣ་རྣམས་ཀྱིས་བསྒྲིབས་པ་དག་གལ་ཏེ་ཡོངས་སུ་དང་བར་གྱུར་ན་ནམ་མཁའི་ཁམས་ཡོངས་སུ་དག་པར་གྱུར་པས་ནམ་མཁའ་མེད་པར་འགྱུར་རོ། །ཞེས་བྱར་མི་རུང་བ་དེ་བཞིན་དུ།
en: As another analogy, if the sky is obscured by smoke, clouds, dust, or mist, when it becomes clear, the element of space becomes pure; therefore, it would not be correct to say that space had ceased to exist.

source: ཆོས་ཀྱི་སྐུ་ཡང་སྡུག་བསྔལ་མང་པོ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་གྱུར་པའི་ཕྱིར་རྣམ་པར་དག་པ་ཞེས་བརྗོད་ཀྱང་ངོ་བོ་ཉིད་མེད་པར་འགྱུར་རོ་ཞེས་བྱར་མི་རུང་ངོ་།
en: In the same way, the Dharma body is called pure because the many sufferings have all come to an end, but it would not be correct to say that the essence did not exist. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་ཞིག་གཉིད་ལོག་པའི་རྨི་ལམ་ན་ཆུ་ཆེན་པོས་ཁྱེར་བ་ལས་རྐང་ལག་བསྐྱོད་དེ་ལུས་དང་སེམས་ལེ་ལོ་མ་བྱས་པའི་ཕྱིར་ཆུ་བོ་ཐད་ཀར་བཅད་དེ་ཕ་རོལ་གྱི་འགྲམ་དུ་ཕྱིན་པར་མཐོང་བ་ལས་རྨི་ལམ་སད་ནས་ཆུ་བོ་དང་ཚུ་རོལ་དང་ཕ་རོལ་གྱི་འགྲམ་ཐ་དད་པར་འགྱུར་བ་མི་མཐོང་ཡང་སེམས་མེད་དོ་ཞེས་བྱར་མི་རུང་ངོ་།
en: Also, as a further analogy, if a man is asleep and in a dream sees himself being swept away by a great river, he moves his legs and arms and is not idle in body or mind, and therefore crosses the river and reaches the far shore. But when he wakes up from that dream, he does not see the river, the riverbank on this side, or the riverbank on the farther side as having separate existences, but it would not be correct to say that there was no mind. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་འཁོར་བའི་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་ཟད་ནས་བློ་རྣམ་པར་དག་པར་གྱུར་ཀྱང་བློ་མེད་དོ་ཞེས་བྱར་མི་རུང་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་དབྱིངས་ཀྱང་ཡང་དག་པ་མ་ཡིན་པའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་མི་སྐྱེ་བའི་ཕྱིར་རྣམ་པར་དག་པ་ཞེས་བརྗོད་ཀྱང་སངས་རྒྱས་རྣམས་ཀྱི་ཡང་དག་པའི་ངོ་བོ་ཉིད་མེད་ཅེས་བྱར་མི་རུང་ངོ་།
en: As a further analogy, the mind becomes pure when the invalid thoughts of saṃsāra cease, but it would not be correct to say that the mind had not existed. In the same way, thoughts do not arise in the Dharma realm, and therefore it is called ‘pure,’ but it would not be correct to say that the true essence of buddhahood was nonexistent. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ཉོན་མོངས་པའི་སྒྲིབ་པ་རྣམ་པར་དག་པར་གྱུར་པས་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་སྟོན་པར་མཛད་དོ།
en: Also, noble one, the enjoyment body manifests because that which is the Dharma body becomes purified of the kleśa obscurations.

source: །ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་གྱུར་པས་ནི་སྤྲུལ་པའི་སྐུ་སྟོན་པར་མཛད་དོ།
en: The emanation body manifests because of being purified of karma obscurations.

source: །ཤེས་བྱའི་སྒྲིབ་པ་རྣམ་པར་དག་པར་གྱུར་པའི་ཕྱིར་ནི་ཆོས་ཀྱི་སྐུ་སྟོན་པར་མཛད་དོ།
en: The Dharma body manifests because of being purified of the obscuration to wisdom. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་བརྟེན་ནས་ནི་གློག་འབྱུང་ལ། གློག་ལ་བརྟེན་ནས་ནི་འོད་འབྱུང་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་སྐུ་ལ་བརྟེན་པའི་ཕྱིར་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་སྟོན་པར་མཛད་དོ། །ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་ལ་བརྟེན་ནས་ནི་སྤྲུལ་པའི་སྐུ་སྟོན་པར་མཛད་དོ།
en: As an analogy, lightning appears on the basis of the sky, and light arises based on the lightning. In the same way, the enjoyment body manifests based on the Dharma body, and the emanation body manifests based on the enjoyment body. “

source: །རང་བཞིན་ཡོངས་སུ་དག་པར་གྱུར་པའི་ཕྱིར་ནི་ཆོས་ཀྱི་སྐུ་སྟོན་པར་མཛད་དོ།
en: The Dharma body manifests because of its pure nature.

source: །ཤེས་རབ་རྣམ་པར་དག་པར་གྱུར་པས་ནི་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་སྟོན་པར་མཛད་དོ།
en: The enjoyment body manifests because of pure wisdom.

source: །ཏིང་ངེ་འཛིན་རྣམ་པར་དག་པར་གྱུར་པས་ནི་སྤྲུལ་པའི་སྐུ་སྟོན་པར་མཛད་དོ།
en: The emanation body manifests because of pure samādhi. “

source: །དེ་གསུམ་རྣམ་པར་དག་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་དང་ཐ་མི་དད་དེ།
en: The purity of those three is no different from the true nature of the Dharma body.

source: དེ་བཞིན་ཉིད་དང་རོ་གཅིག་པའི་དེ་བཞིན་ཉིད་དང་། རྣམ་པར་གྲོལ་བའི་དེ་བཞིན་ཉིད་དང་། མཐར་ཐུག་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པས་དེའི་ཕྱིར་སངས་རྒྱས་རྣམས་ཀྱི་སྐུ་ལ་ཐ་དད་པར་གྱུར་པ་མེད་དོ།
en: Therefore, that which is the true nature— the true nature of one taste, the true nature of liberation, and the ultimate true nature—is no different from the bodies of the buddhas. “

source: །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་ནི་བདག་གི་སྟོན་པ་ཆེན་པོ་ཡིན་ནོ་ཞེས་དེ་ལྟར་ངེས་པར་མངོན་པར་ཡིད་ཆེས་པའི་གང་ཟག་དེས་ནི་ཤིན་ཏུ་དང་བའི་བསམ་པས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཐ་དད་པ་མི་མངའ་བར་ཁོང་དུ་ཆུད་པར་གྱུར་པར།
en: The noble men or noble women who say, ‘The Tathāgata is our great teacher,’ those individuals who have true conviction, understand with clear minds that the bodies of the tathāgatas are not separate. “

source: རིགས་ཀྱི་བུ་དོན་དེའི་ཕྱིར་སྤྱོད་ཡུལ་རྣམས་ལ་ཡང་དག་པ་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་ཡོངས་སུ་བསལ་བར་གྱུར་ན་ཆོས་དེ་དག་ལ་མཚན་ཉིད་གཉིས་མེད་པར་ཁོང་དུ་ཆུད་ཅིང་རྣམ་པར་རྟོག་པ་ཡང་མེད་པར་འགྱུར་རོ།
en: Therefore, noble one, if invalid mentation is dispelled from all fields of experience, there will be the realization that there are no dualistic characteristics, and thoughts will cease.

source: །འཕགས་པའི་རྣལ་འབྱོར་སྒོམ་པ་ལ་དེ་བཞིན་ཉིད་དེ་མཚན་ཉིད་གཉིས་སུ་གྱུར་པ་མེད་ཅིང་ཡང་དག་པར་རྣལ་འབྱོར་སྒོམ་པའི་ཕྱིར་འདི་ལྟར་དེ་བཞིན་དུ་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བསལ་བས་ཉེ་བར་ཞི་བར་འགྱུར་རོ།
en: In the practice of the āryas, that true nature has no dualistic characteristics, and they practice correctly so that all obscurations are eliminated and completely cease. “

source: །དེ་བཞིན་ཉིད་སྒྲིབ་པ་ཐམས་ཅད་ཞི་བར་གྱུར་པས་འདི་ལྟར་དེ་བཞིན་དུ་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་མཆོག་ཏུ་རྣམ་པར་དག་པ་ཐོབ་པར་འགྱུར་རོ།
en: Through the obscurations of the true nature ceasing, there is the attainment of the true nature and the perfectly pure wisdom of the true nature. “

source: །དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་ཡེ་ཤེས་རྣམ་པར་དག་པར་གྱུར་པས་འདི་ལྟར་དེ་བཞིན་དུ་རང་དབང་དུ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྡུད་པར་འགྱུར།
en: Through the Dharma realm, the true nature, and valid wisdom becoming purified, there will be the accumulation of a perfection of independent power.

source: སྒྲིབ་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་ཡང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་པའི་ཕྱིར་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་ཡེ་ཤེས་དང་། ཡང་དག་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: There will also be complete cessation of all obscurations, the attainment of purification from all obscurations, and therefore that is called ‘the true nature,’ ‘the true wisdom,’ and ‘the true characteristics.’

source: །དེ་ལྟར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་འཕགས་པའི་ལྟ་བ་ཞེས་བྱ་བས་དེ་ནི་ཡང་དག་པ་ཉིད་དུ་སངས་རྒྱས་མཐོང་བ་ཞེས་བྱའོ།
en: Seeing that is called ‘the view of the āryas,’ and therefore it is called ‘truly seeing buddhahood.’ “

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་མཐོང་བའི་ཕྱིར་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མ་ལུས་པར་གཟིགས་པར་འགྱུར་རོ།
en: It is because the true nature of phenomena is seen correctly, and therefore the tathāgatas see all the tathāgatas. “

source: ཉས་ཐོས་དང་། རང་སངས་རྒྱས་ཁམས་གསུམ་ལས་ངེས་པར་བྱུང་ནས་ཡང་དག་པའི་སྤྱོད་ཡུལ་ཡོངས་སུ་ཚོལ་བས་ཀྱང་ཁོང་དུ་མི་ཆུད་ཅིང་མཐོང་བར་མི་ནུས་པས་སོ།
en: The śrāvakas and pratyekabuddhas who depart from the three realms seek the true field of experience, but they do not know it or see it.

source: །དེ་ལྟ་བུའི་འཕགས་པའི་གང་ཟག་དག་གིས་ཀྱང་མི་རིག་ཅིང་མི་མཐོང་བས་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཐེ་ཙོམ་དང་སོམ་ཉི་བསྐྱེད་ནས་ཕྱིན་ཅི་ལོག་ཏུ་རྣམ་པར་རྟོག་པར་བྱེད་པས་ཡོངས་སུ་འདའ་བར་མི་འགྱུར་རོ།
en: Because such ārya individuals cannot comprehend or see it, all ordinary beings develop doubt and uncertainty, have incorrect thoughts, and are unable to transcend them. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་རི་བོང་རྒྱ་མཚོ་ལ་རྐྱལ་བར་བྱེད་ཀྱང་གདོན་མི་ཟ་བར་ཕ་རོལ་དུ་ཕྱིན་པར་མི་འགྱུར་རོ།
en: As an analogy, if a weak rabbit were to try to leap across an ocean, there is no doubt that it would not reach the other side.

source: ཉམ་སྟོབས་ཤིན་དུ་ཆུང་བའི་ཕྱིར་རོ།
en: Because it has very little strength.

source: །བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱང་དེ་བཞིན་དུ་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་མངོན་པར་མི་རྟོགས་སོ།
en: In the same way, childlike, ordinary beings cannot understand the true nature of phenomena. “

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་རྣམ་པར་རྟོག་པའི་དགོངས་པ་མི་མངའ་བར་ཡང་ཆོས་ཐམས་ཅད་ལ་མངའ་ཆེན་པོ་བརྙེས་ཤིང་ཤེས་རབ་ཤིན་ཏུ་ཟབ་ཅིང་རྣམ་པར་དག་པ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པའི་ཕྱིར་དང་།
en: The tathāgatas do not possess a viewpoint comprised of thoughts, but they have attained great power over phenomena and have perfectly pure, extremely profound wisdom, and their field of experience is not the same as that of others.

source: རང་གི་སྤྱོད་ཡུལ་དུ་གྱུར་ཅིང་གཞན་དང་ཡང་ཐུན་མོང་དུ་མ་གྱུར་པའི་ཕྱིར་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་དཔག་ཏུ་མེད་པ་ནས་ཉིད་ཀྱི་སྐུ་སྲོག་ལ་ཕངས་པ་མི་མངའ་བར་དཀའ་བ་སྤྱོད་པས་དཔེ་ཟླ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ། ཚིག་གི་སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདས་པ། རབ་ཏུ་དབེན་པ། འཇིགས་པ་རྣམས་དང་བྲལ་བའི་སྐུ་མཆོག་དམ་པ་འདི་བརྙེས་པ་ཡིན་ནོ།
en: Therefore, the tathāgatas, without concern for their own bodies and lives, through having undergone hardships for countless, innumerable eons, have attained this supreme, sublime body that is inconceivable, incomparable, beyond the scope of words, perfectly distinct, and free from all fear. “

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཆོས་ཀྱི་དེ་བཞིན་ཉིད་རིག་ཅིང་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བ་མེད་པ། ཚེའི་ཚད་ཀྱང་དཔག་ཏུ་མེད། གཉིད་ཀྱང་མེད།
en: Noble one, the one who knows and sees the true nature of phenomena has no birth, aging, sickness, or death; has an immeasurable lifespan; has no need for sleep; has no hunger; has no thirst; and has a mind that is always in samādhi without distraction or instability. “

source: བཀྲེས་པ་དང་། སྐོམ་པ་ཡང་མེད་དེ། རྟག་པར་ཏིང་ངེ་འཛིན་ལ་གནས་པའི་སེམས་རྣམ་པར་གཡེང་ཞིང་གཡོ་བ་ཡང་མེད་དོ། །གང་གིས་དེ་བཞིན་གཤེགས་པ་ལ་རྩོད་པའི་བསམ་པ་སྐྱེད་པ་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་མི་འགྱུར་རོ།
en: Whoever develops the aspiration to argue with the Tathāgata will not see the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་གང་ཅི་གསུང་ཡང་རུང་སྟེ་ཐམས་ཅད་ལ་ཕན་འདོགས་པར་འགྱུར་བས་གང་གིས་མཉན་ཅིང་ཐོས་པ་དེ་དག་རྣམ་པར་མི་གྲོལ་བ་གང་ཡང་མེད་དོ།
en: Whatever the tathāgatas say is beneficial for everyone, and therefore whoever listens and hears that will certainly be liberated.

source: །གཅན་གཟན་མ་རུངས་པ་དང་། མི་མ་རུངས་པ་དང་། འདྲེ་སྲིན་མ་རུངས་པ་དག་དང་ཡང་ཕྲད་པར་མི་འགྱུར་ཏེ།
en: They will not encounter vicious beasts, vicious humans, or vicious spirits.

source: ཆོས་ཐོས་པའི་དབང་གིས་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཟད་པར་མི་འགྱུར་རོ།
en: There will be no end to the ripening of results from hearing the Dharma. “
